Catalogs/ТочкиЦелевые.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>ТочкиЦелевые</Name>
			<Comment>Целевые точки</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Очередь</Name>
					<Comment>Очередь подсистемы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелОчереди</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПроекта</Name>
					<Comment>Код проекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>45</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактЦентр</Name>
					<Comment>Обслуживающий контакт-центр</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Comment>График работы по-умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьСМС</Name>
					<Comment>Учетная запись для отправки визитных карточек</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КлючиВИсточникахДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Comment>Момент времени установки ГУИД</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКлюча</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИБ_ТипыДанных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеКлюча</Name>
							<Comment>Идентификатор (ГУИД для справочника) в источнике данных</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеКлюча</Name>
							<Comment>Для справочника - наименование; для перечисления - представление</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопПредставлениеКлюча</Name>
							<Comment>Для справочника - код, для перечисления - порядковый номер значения</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ТочкиЦелевые/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ,СтандартнаяОбработка)

// Линейный элемент справочника не может находиться вне группы
//-------------------------------------------------------------------------------------------------
	Если (НЕ ЗначениеЗаполнено(Объект.Родитель)) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Целевая точка должена обязательно принадлежать группе";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

//-------------------------------------------------------------------------------------------------

&НаКлиенте
Процедура НадписьГрафикРаботыНажатие(Элемент)
	Если (ЗначениеЗаполнено(Объект.Ссылка)) Тогда
		СтрПараметры = Новый Структура("ОбъектСсылка",Объект.Ссылка);
		ОткрытьФорму("Справочник.ГрафикиРаботы.Форма.ОбъектГрафикРаботы",СтрПараметры);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Представление_в_Идентификатор(Команда)	
	СформироватьКлюч_длиной_N(1);
КонецПроцедуры

&НаКлиенте 
Процедура СформироватьКлюч_длиной_N(КоличествоКлючей)
	
	ТекДанные = ЭтаФорма.Элементы.КлючиВИсточникахДанных.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Для Сч = 1 По КоличествоКлючей Цикл
		
		//Если ключ не составной, т.е. количество ключей равно единице
		//------------------------------------------------------------
		Если КоличествоКлючей = 1 Тогда
			НомерКлюча = "";  // цикл будет выполнен один раз
		Иначе
			НомерКлюча=Сч;
		КонецЕсли;
		
		//Определи названия реквизитов
		//------------------------------
		ИмяРеквТипКлюча					=	"ТипКлюча"+НомерКлюча;		
		ИмяРеквЗначениеКлюча			=	"ЗначениеКлюча"+НомерКлюча;
		ИмяРеквПредставлениеКлюча		=	"ПредставлениеКлюча"+НомерКлюча;
		ИмяРеквДопПредставлениеКлюча	=	"ДопПредставлениеКлюча"+НомерКлюча;	

		
		Если Не ЗначениеЗаполнено(ТекДанные.ТипКлюча)Тогда
		Сообщить("Не указан тип данных "+НомерКлюча);
			Прервать;
		КонецЕсли;
	
		Доступно = ЗначениеЗаполнено(ТекДанные[ИмяРеквПредставлениеКлюча]) Или ЗначениеЗаполнено(ТекДанные[ИмяРеквДопПредставлениеКлюча]);
		Если Не Доступно Тогда
			Сообщить("Не заполнено ни наименование, ни код для ключа "+НомерКлюча);
			Прервать;
		КонецЕсли;
					
		Если ЗначениеЗаполнено(ТекДанные[ИмяРеквДопПредставлениеКлюча]) Тогда
			ИмяРеквизитПоиска 			= "Код";
			ЗначениеРеквзитаПоиска 	= СокрЛП( ТекДанные[ИмяРеквДопПредставлениеКлюча] );

		ИначеЕсли ЗначениеЗаполнено(ТекДанные[ИмяРеквПредставлениеКлюча]) Тогда
			ИмяРеквизитПоиска 			= "Наименование";
			ЗначениеРеквзитаПоиска 	= СокрЛП( ТекДанные[ИмяРеквПредставлениеКлюча] );
		КонецЕсли;
		
		Представление_в_Идентификатор_НаСервере(ТекДанные["НомерСтроки"], НомерКлюча, ТекДанные[ИмяРеквТипКлюча], ИмяРеквизитПоиска, ЗначениеРеквзитаПоиска);
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура Представление_в_Идентификатор_НаСервере(НомерСтроки, НомерКлюча, ТипДанных, ИмяРеквизита, ЗначениеРеквизита)

	Об = РеквизитФормыВЗначение("Объект");
	//Об.Реквизит_в_Идентификатор(НомерСтроки, НомерКлюча,ТипДанных, ИмяРеквизита, ЗначениеРеквизита);
	КонсолидацияСервер.Реквизит_в_Идентификатор(Об, "КлючиВИсточникахДанных",НомерСтроки, НомерКлюча,ТипДанных, ИмяРеквизита, ЗначениеРеквизита);

	Если Об.Модифицированность() Тогда
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(Об, "Объект");
	
КонецПроцедуры
